# SQL Bolt

## Interactive Tutorial

https://sqlbolt.com/

### Table of Contents
1. SELECT queries
2. Queries with constraints (Pt. 1)
3. Queries with constraints (Pt. 2)
4. Filtering and sorting Query results
5. Simple SELECT Queries Review
6. Multi-table queries with JOINs
7. OUTER JOINs
8. A short note on NULLs
9. Queries with expressions
10. Queries with aggregates (Pt. 1)
11. Queries with aggregates (Pt. 2)
12. Order of execution of a Query
13. Inserting rows
14. Updating rows
15. Deleting rows
16. Creating tables
17. Altering tables
18. Dropping tables
19. Subqueries
20. Unions, Intersections & Exceptions

### SQL Lesson 1: SELECT queries

#### Task 1

Find the title of each film

<span style="background-color: silver">SELECT title FROM movies;</span>

#### Task 2
Find the director of each film

<span style="background-color: silver">SELECT director FROM movies;</span>

#### Task 3
Find the title and director of each film

<span style="background-color: silver">SELECT title, director FROM movies;</span>

#### Task 4
Find the title and year of each film

<span style="background-color: silver">SELECT title, year FROM movies;</span>

#### Task 5
Find all the information about each film

<span style="background-color: silver">SELECT * FROM movies;</span>

### SQL Lesson 2: Queries with constraints (Pt. 1)

#### Task 1
Find the movie with a row id of 6

<span style="background-color: silver">SELECT * FROM movies WHERE id = 6;</span>

#### Task 2
Find the movies released in the years between 2000 and 2010

<span style="background-color: silver">SELECT * FROM movies WHERE year BETWEEN 2000 and 2010;</span>

#### Task 3
Find the movies not released in the years between 2000 and 2010

<span style="background-color: silver">SELECT * FROM movies WHERE year NOT BETWEEN 2000 and 2010;</span>

#### Task 4
Find the first 5 Pixar movies and their release year

<span style="background-color: silver">SELECT title, year FROM movies WHERE year < 2004;</span>

### SQL Lesson 3: Queries with constraints (Pt. 2)

#### Task 1
Find all the Toy Story movies

 <span style="background-color: silver">SELECT * FROM movies WHERE title LIKE 'Toy Story%';</span>

#### Task 2
Find all the movies directed by John Lasseter

<span style="background-color: silver">SELECT * FROM movies WHERE director = 'John Lasseter';</span>

#### Task 3
Find all the movies (and director) not directed by John Lasseter

<span style="background-color: silver">SELECT title, director FROM movies WHERE director != 'John Lasseter';</span>

#### Task 4
Find all the WALL-* movies

<span style="background-color: silver">SELECT * FROM movies WHERE title LIKE 'WALL-%';</span>

### SQL Lesson 4: Filtering and sorting Query results

#### Task 1
List all directors of Pixar movies (alphabetically), without duplicates

<span style="background-color: silver">SELECT DISTINCT(director) FROM movies ORDER BY director ASC;</span>

#### Task 2
List the last four Pixar movies released (ordered from most recent to least)

<span style="background-color: silver">SELECT * FROM movies ORDER BY year DESC LIMIT 4;</span>

#### Task 3
List the first five Pixar movies sorted alphabetically

<span style="background-color: silver">SELECT * FROM movies ORDER BY title ASC LIMIT 5;</span>

#### Task 4
List the next five Pixar movies sorted alphabetically

<span style="background-color: silver">SELECT * FROM movies ORDER BY title ASC LIMIT 5 OFFSET 5;;</span>

### SQL Lesson 5: Simple SELECT Queries Review

#### Task 1
List all the Canadian cities and their populations

<span style="background-color: silver">SELECT city, country, population FROM north_american_cities WHERE country = 'Canada';</span>

#### Task 2
Order all the cities in the United States by their latitude from north to south

<span style="background-color: silver">SELECT city, country, latitude FROM north_american_cities WHERE country = 'United States' ORDER BY latitude DESC;</span>

#### Task 3
List all the cities west of Chicago, ordered from west to east

<span style="background-color: silver">SELECT city, country, longitude FROM north_american_cities WHERE longitude < -87.629798 ORDER BY longitude ASC;</span>

#### Task 4
List the two largest cities in Mexico (by population)

<span style="background-color: silver">SELECT city, country, population FROM north_american_cities WHERE country = 'Mexico' ORDER BY population DESC LIMIT 2;</span>

#### Task 5
List the third and fourth largest cities (by population) in the United States and their population

<span style="background-color: silver">SELECT city, country, population FROM north_american_cities WHERE country = 'United States' ORDER BY population DESC LIMIT 2 OFFSET 2;</span>

### SQL Lesson 6: Multi-table queries with JOINs

#### Task 1
Find the domestic and international sales for each movie

<span style="background-color: silver">SELECT title, domestic_sales, international_sales FROM movies INNER JOIN boxoffice ON movies.id = boxoffice.movie_id;;</span>

#### Task 2
Show the sales numbers for each movie that did better internationally rather than domestically

<span style="background-color: silver">SELECT title, domestic_sales, international_sales FROM movies INNER JOIN boxoffice ON movies.id = boxoffice.movie_id WHERE international_sales > domestic_sales;</span>

#### Task 3
List all the movies by their ratings in descending order

<span style="background-color: silver">SELECT title, rating FROM movies INNER JOIN boxoffice ON movies.id = boxoffice.movie_id ORDER BY rating DESC;</span>

### SQL Lesson 7: OUTER JOINs

#### Task 1
Find the list of all buildings that have employees

<span style="background-color: silver">SELECT DISTINCT(building_name) FROM buildings AS l INNER JOIN employees AS r ON l.building_name = r.building;</span>

#### Task 2
Find the list of all buildings and their capacity

<span style="background-color: silver">SELECT DISTINCT(building_name), capacity FROM buildings AS l LEFT JOIN employees AS r ON l.building_name = r.building;</span>

#### Task 3
List all buildings and the distinct employee roles in each building (including empty buildings)

<span style="background-color: silver">SELECT DISTINCT(building_name), role FROM buildings AS l LEFT JOIN employees AS r ON l.building_name = r.building;</span>

### SQL Lesson 8: A short note on NULLs

#### Task 1
Find the name and role of all employees who have not been assigned to a building

<span style="background-color: silver">SELECT name, role, building FROM employees WHERE building IS NULL;</span>

#### Task 2
Find the names of the buildings that hold no employees

<span style="background-color: silver"> SELECT building_name, name FROM buildings AS l LEFT JOIN employees AS r ON l.building_name = r.building WHERE name IS NULL;</span>

### SQL Lesson 9: Queries with expressions

#### Task 1
List all movies and their combined sales in millions of dollars

<span style="background-color: silver">SELECT title, (domestic_sales + international_sales) / 1000000 AS combined_sales FROM movies INNER JOIN boxoffice ON movies.id = boxoffice.movie_id ORDER BY combined_sales DESC;</span>

#### Task 2
List all movies and their ratings in percent

<span style="background-color: silver">SELECT title, rating * 10 AS ratings_pct FROM movies INNER JOIN boxoffice ON movies.id = boxoffice.movie_id ORDER BY ratings_pct DESC;</span>

#### Task 3
List all movies that were released on even number years

<span style="background-color: silver">SELECT title, year FROM movies WHERE year % 2 = 0 ORDER BY year ASC;</span>

### SQL Lesson 10: Queries with aggregates (Pt. 1)

#### Task 1
Find the longest time that an employee has been at the studio

<span style="background-color: silver">SELECT MAX(years_employed) FROM employees;</span>

#### Task 2
For each role, find the average number of years employed by employees in that role

<span style="background-color: silver">SELECT role, AVG(years_employed) AS avg_years_empl FROM employees GROUP BY role;</span>

#### Task 3
Find the total number of employee years worked in each building

<span style="background-color: silver">SELECT building, SUM(years_employed) FROM employees GROUP BY building;</span>

### SQL Lesson 11: Queries with aggregates (Pt. 2)

#### Task 1
Find the number of Artists in the studio (without a HAVING clause)

<span style="background-color: silver">SELECT COUNT(role) FROM employees WHERE role = 'Artist';</span>

#### Task 2
Find the number of Employees of each role in the studio

<span style="background-color: silver">SELECT role, COUNT(role) FROM employees GROUP BY role;</span>

#### Task 3
Find the total number of years employed by all Engineers

<span style="background-color: silver">SELECT role, SUM(years_employed) FROM employees GROUP BY role HAVING role = 'Engineer';</span>

### SQL Lesson 12: Order of execution of a Query

#### Task 1
Find the number of movies each director has directed

<span style="background-color: silver">SELECT director, COUNT(title) AS num_movies FROM movies GROUP BY director ORDER BY num_movies DESC;</span>

#### Task 2
Find the total domestic and international sales that can be attributed to each director

<span style="background-color: silver">SELECT director, SUM(domestic_sales) + SUM(international_sales) AS total_revenue FROM movies AS l LEFT JOIN boxoffice AS r ON l.id = r.movie_id GROUP BY director ORDER BY total_revenue DESC;</span>

### SQL Lesson 13: Inserting rows

#### Task 1
Add the studio's new production, Toy Story 4 to the list of movies (you can use any director)

<span style="background-color: silver">INSERT INTO movies (title, director, year, length_minutes) VALUES ('Toy Story 4', 'Josh Cooley', 2019, 100);</span>

#### Task 2
Toy Story 4 has been released to critical acclaim! It had a rating of 8.7, and made 340 million domestically and 270 million internationally. Add the record to the BoxOffice table.

<span style="background-color: silver">INSERT INTO boxoffice (movie_id, rating, domestic_sales, international_sales) VALUES (15, 8.7, 340000000, 270000000);</span>

### SQL Lesson 14: Updating rows

#### Task 1
The director for A Bug's Life is incorrect, it was actually directed by John Lasseter

<span style="background-color: silver">UPDATE movies SET director = 'John Lasseter' WHERE title = "A Bug's Life";</span>

#### Task 2
The year that Toy Story 2 was released is incorrect, it was actually released in 1999

<span style="background-color: silver">UPDATE movies SET year = 1999 WHERE title = 'Toy Story 2';</span>

#### Task 3
Both the title and director for Toy Story 8 is incorrect! The title should be "Toy Story 3" and it was directed by Lee Unkrich

<span style="background-color: silver">UPDATE movies SET title = 'Toy Story 3', director = 'Lee Unkrich' WHERE title = 'Toy Story 8';</span>

### SQL Lesson 15: Deleting rows

#### Task 1
This database is getting too big, lets remove all movies that were released before 2005

<span style="background-color: silver">DELETE FROM movies WHERE year < 2005;</span>

#### Task 2
Andrew Stanton has also left the studio, so please remove all movies directed by him

<span style="background-color: silver">DELETE FROM movies WHERE director = 'Andrew Stanton';</span>

### SQL Lesson 16: Creating tables

#### Task 1
Create a new table named Database with the following columns:

Name A string (text) describing the name of the database
Version A number (floating point) of the latest version of this database
Download_count An integer count of the number of times this database was downloaded
This table has no constraints.

<span style="background-color: silver">CREATE TABLE IF NOT EXISTS Database ( Name text, Version float, Download_count int );</span>

### SQL Lesson 17: Altering tables

#### Task 1
Add a column named Aspect_ratio with a FLOAT data type to store the aspect-ratio each movie was released in.

<span style="background-color: silver">ALTER TABLE movies ADD Aspect_ratio float;</span>

#### Task 2
Add another column named Language with a TEXT data type to store the language that the movie was released in. Ensure that the default for this language is English.

<span style="background-color: silver">ALTER TABLE movies ADD Language text DEFAULT 'English';</span>

#### Task 3
Altering table to remove column(s).

<span style="background-color: silver">ALTER TABLE mytable DROP column_to_be_deleted;</span>

#### Task 4
Rename the table itself.

<span style="background-color: silver">ALTER TABLE mytable RENAME TO new_table_name;</span>

### SQL Lesson 18: Dropping tables

#### Task 1
We've sadly reached the end of our lessons, lets clean up by removing the Movies table

<span style="background-color: silver">DROP TABLE IF EXISTS movies;</span>

#### Task 2
And drop the BoxOffice table as well

<span style="background-color: silver">DROP TABLE IF EXISTS boxoffice;</span>

### SQL Lesson 19: Subqueries

#### Task 1
Find out which of your Associates are costing the company more than the average revenue brought per Associate.

<span style="background-color: silver">SELECT * FROM sales_associates WHERE salary > ( SELECT AVG(revenue_generated) FROM sales_associates );</span>

#### Task 2
For each employee, you would need to calculate their cost relative to the average revenue generated by all people in their department.

<span style="background-color: silver">SELECT * FROM employees WHERE salary > ( SELECT AVG(revenue_generated) FROM employees AS dept_employees WHERE dept_employees.department = employees.department );</span>

### SQL Extra: Unions, Intersections & Exceptions

The UNION and UNION ALL operator allows you to append the results of one query to another assuming that they have the same column count, order and data type. If you use the UNION without the ALL, duplicate rows between the tables will be removed from the result.

The INTERSECT operator will ensure that only rows that are identical in both result sets are returned.

The EXCEPT operator will ensure that only rows in the first result set that aren't in the second are returned.

Both INTERSECT and EXCEPT also discard duplicate rows after their respective operations, though some databases also support INTERSECT ALL and EXCEPT ALL to allow duplicates to be retained and returned.

-- Select query with set operators

SELECT column, another_column FROM mytable UNION / UNION ALL / INTERSECT / EXCEPT SELECT other_column, yet_another_column FROM another_table ORDER BY column DESC LIMIT n;